In [61]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn import metrics

In [47]:
df=pd.read_csv('logistic_regression_dataset.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [49]:
X=df.iloc[:,2:4]
Y=df['Purchased']
arr=df[['Gender']]
X

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [50]:
encode=OneHotEncoder(sparse=False)
new_df=encode.fit_transform(arr)
df1=pd.DataFrame(new_df,columns=['Male','Female'])
df1

     Male  Female
0     0.0     1.0
1     0.0     1.0
2     1.0     0.0
3     1.0     0.0
4     0.0     1.0
..    ...     ...
395   1.0     0.0
396   0.0     1.0
397   1.0     0.0
398   0.0     1.0
399   1.0     0.0

[400 rows x 2 columns]

In [60]:
X['Male']=df1['Male']
X['Female']=df1['Female']
Y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [64]:
X_train,X_test,y_train,y_test=train_test_split(X,Y,test_size=0.2)

In [65]:
logistic_reg=LogisticRegression()
model=logistic_reg.fit(X_train,y_train)
y_pred=logistic_reg.predict(X_test)

In [66]:
cnf_matrix = metrics.confusion_matrix(y_test, y_pred)
cnf_matrix

array([[54,  0],
       [26,  0]], dtype=int64)

In [67]:
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.675